In [8]:
import pandas as pd

In [13]:
df=pd.read_csv("students.csv")
df1=pd.read_csv("marks.csv")

In [14]:
df.head()
df1.head()

   Student_ID  Marks  Attendance
0         101     85          90
1         102     78          85
2         104     88          92
3         105     70          80

In [15]:
#merging two datasets (left)
merged=pd.merge(df,df1,on="Student_ID", how="left")
merged.head()

   Student_ID   Name Course    City  Marks  Attendance
0         101  Aarav     CS  Mumbai   85.0        90.0
1         102  Meera     IT    Pune   78.0        85.0
2         103  Rahul     CS  Mumbai    NaN         NaN
3         104  Priya     IT    Pune   88.0        92.0
4         105  Karan     IT  Mumbai   70.0        80.0

In [20]:
#merging two datasets (right)
merged1=pd.merge(df1,df,on="Student_ID", how="right")
merged1.head()

   Student_ID  Marks  Attendance   Name Course    City
0         101   85.0        90.0  Aarav     CS  Mumbai
1         102   78.0        85.0  Meera     IT    Pune
2         103    NaN         NaN  Rahul     CS  Mumbai
3         104   88.0        92.0  Priya     IT    Pune
4         105   70.0        80.0  Karan     IT  Mumbai

In [18]:
#merging two datasets (inner)
merged2=pd.merge(df,df1,on="Student_ID", how="inner")
merged2.head()

   Student_ID   Name Course    City  Marks  Attendance
0         101  Aarav     CS  Mumbai     85          90
1         102  Meera     IT    Pune     78          85
2         104  Priya     IT    Pune     88          92
3         105  Karan     IT  Mumbai     70          80

In [19]:
#merging two datasets (outer)
merged4=pd.merge(df,df1,on="Student_ID", how="outer")
merged4.head()

   Student_ID   Name Course    City  Marks  Attendance
0         101  Aarav     CS  Mumbai   85.0        90.0
1         102  Meera     IT    Pune   78.0        85.0
2         103  Rahul     CS  Mumbai    NaN         NaN
3         104  Priya     IT    Pune   88.0        92.0
4         105  Karan     IT  Mumbai   70.0        80.0

In [23]:
#Filtering
df=pd.read_csv("students.csv")

In [24]:
df.head()

   Student_ID   Name Course    City
0         101  Aarav     CS  Mumbai
1         102  Meera     IT    Pune
2         103  Rahul     CS  Mumbai
3         104  Priya     IT    Pune
4         105  Karan     IT  Mumbai

In [25]:
df1=pd.read_csv("marks.csv")
df1.head()

   Student_ID  Marks  Attendance
0         101     85          90
1         102     78          85
2         104     88          92
3         105     70          80

In [26]:
#Find students with marks < 80
df1[df1["Marks"]<80]

   Student_ID  Marks  Attendance
1         102     78          85
3         105     70          80

In [27]:
#Find students from CS course with attendance > 85
merged=pd.merge(df,df1,on="Student_ID",how="inner")
merged[(merged["Course"]=="CS")&(merged["Attendance"]>85)]

   Student_ID   Name Course    City  Marks  Attendance
0         101  Aarav     CS  Mumbai     85          90

In [31]:
#Groupby
#Average marks per course
df.groupby("Course")["Student_ID"].mean().reset_index()

  Course  Student_ID
0     CS  102.000000
1     IT  103.666667

In [38]:
#Number of students per course
df.groupby("Course")["Student_ID"].count().reset_index()

  Course  Student_ID
0     CS           2
1     IT           3

In [39]:
#Merging
#Left merge Students & marks
left_merge=pd.merge(df,df1,on="Student_ID",how="left")
left_merge.head()

   Student_ID   Name Course    City  Marks  Attendance
0         101  Aarav     CS  Mumbai   85.0        90.0
1         102  Meera     IT    Pune   78.0        85.0
2         103  Rahul     CS  Mumbai    NaN         NaN
3         104  Priya     IT    Pune   88.0        92.0
4         105  Karan     IT  Mumbai   70.0        80.0

In [40]:
#find sutdents who have no marks data
left_merge[left_merge["Marks"].isna()]

   Student_ID   Name Course    City  Marks  Attendance
2         103  Rahul     CS  Mumbai    NaN         NaN